 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(3) VALUE 20.
 01 B PIC 9(3) VALUE 5.
 01 C PIC 9(3).
 PROCEDURE DIVISION.
     SUBTRACT B FROM A GIVING C.
     DISPLAY A " " B " " C.
