 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 10.
 PROCEDURE DIVISION.
     SUBTRACT 3 FROM X.
     DISPLAY X.
