 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(3) VALUE 30.
 01 B PIC 9(3) VALUE 40.
 PROCEDURE DIVISION.
     SUBTRACT 5 FROM A B.
     DISPLAY A " " B.
