 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 50.
 PROCEDURE DIVISION.
     SUBTRACT 10 5 FROM X.
     DISPLAY X.
