 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME PIC X(10) VALUE "MATT".
 PROCEDURE DIVISION.
     IF NAME = "ALEX"
         DISPLAY "MATCH".
     ELSE
         DISPLAY "NO".
     END-IF.
