 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME PIC X(10) VALUE "MATT".
 01 N    PIC 9(2).
 PROCEDURE DIVISION.
     COMPUTE N = FUNCTION LENGTH(FUNCTION TRIM(NAME)).
     DISPLAY N.
     STOP RUN.
