 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME PIC X(10) VALUE "MATT".
 PROCEDURE DIVISION.
     IF NAME = 42
         DISPLAY "MATCH".
     END-IF.
