 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME PIC X(10) VALUE "MATT".
 PROCEDURE DIVISION.
     IF NAME < "ZULU"
         DISPLAY "BEFORE-Z".
     END-IF.
     IF NAME > "ALEX"
         DISPLAY "AFTER-A".
     END-IF.
