 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME PIC X(10) VALUE "matt".
 PROCEDURE DIVISION.
     IF FUNCTION UPPER-CASE(NAME) = "MATT"
         DISPLAY "MATCH".
     ELSE
         DISPLAY "NO".
     END-IF.
