 IDENTIFICATION DIVISION.
 PROGRAM-ID. PROG.
 DATA DIVISION.
 FILE SECTION.
 FD INPUT-FILE.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 7.
 PROCEDURE DIVISION.
     DISPLAY X.
