 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 STUDENT.
    05 NAME PIC X(5).
    05 AGE PIC 9(2).
 PROCEDURE DIVISION.
     DISPLAY "OK".
