 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 GROUP.
    05 INNER PIC X(3).
 77 STANDALONE PIC 9(3).
 PROCEDURE DIVISION.
     DISPLAY "OK".
