 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 GREETING PIC X(10) VALUE "HI".
 PROCEDURE DIVISION.
     DISPLAY "OK".
