 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC S9(3).
 PROCEDURE DIVISION.
     MOVE -5 TO X.
     DISPLAY X.
     STOP RUN.
