 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 RECORD.
    05 FIRST PIC X(3) VALUE "ABC".
    05 SECOND PIC X(2) VALUE "XY".
 PROCEDURE DIVISION.
     DISPLAY RECORD.
