 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 COUNTER PIC 9(3) VALUE 7.
 PROCEDURE DIVISION.
     DISPLAY COUNTER.
