 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     DISPLAY "MAIN".
     PERFORM SUB.
     DISPLAY "AFTER-PERFORM".
 SUB.
     DISPLAY "SUB".
     GOBACK.
