 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 5.
 01 Y PIC 9(3) VALUE 5.
 PROCEDURE DIVISION.
     IF X = 5 AND Y = 5 THEN
         DISPLAY "BOTH".
     ELSE
         DISPLAY "NO".
     END-IF.
