 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 5.
 PROCEDURE DIVISION.
     IF X < 10 THEN DISPLAY "LT". END-IF.
     IF X > 1  THEN DISPLAY "GT". END-IF.
     IF X <= 5 THEN DISPLAY "LE". END-IF.
     IF X >= 5 THEN DISPLAY "GE". END-IF.
