 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 4.
 PROCEDURE DIVISION.
     IF (X + 1) > 4 THEN
         DISPLAY "OK".
     END-IF.
