 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 5.
 PROCEDURE DIVISION.
     IF X = 0 THEN
         DISPLAY "ZERO".
     ELSE
         DISPLAY "NONZERO".
     END-IF.
