 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 7.
 PROCEDURE DIVISION.
     IF X NOT = 0 THEN
         DISPLAY "NZ".
     END-IF.
