 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 0.
 01 Y PIC 9(3) VALUE 0.
 PROCEDURE DIVISION.
     IF X = 0 THEN
         IF Y = 0 THEN
             DISPLAY "BOTH".
         END-IF
     END-IF.
