 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 1.
 PROCEDURE DIVISION.
     IF X = 1 OR X = 2 THEN
         DISPLAY "MATCH".
     END-IF.
