 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 0.
 PROCEDURE DIVISION.
     DISPLAY "BEFORE".
     IF X = 0 THEN
         STOP RUN.
     END-IF.
     DISPLAY "AFTER".
