 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 0.
 PROCEDURE DIVISION.
     IF X = 0 THEN
         DISPLAY "ZERO".
     END-IF.
