 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(3) VALUE 5.
 01 B PIC 9(3) VALUE 7.
 01 C PIC 9(3) VALUE 99.
 PROCEDURE DIVISION.
     ADD A B GIVING C.
     DISPLAY C.
