 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(3) VALUE 10.
 01 B PIC 9(3) VALUE 20.
 PROCEDURE DIVISION.
     ADD 1 2 TO A B.
     DISPLAY A " " B.
