 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 LABEL PIC X(5) VALUE "HELLO".
 01 N PIC 9(3) VALUE 10.
 PROCEDURE DIVISION.
     ADD LABEL TO N.
