 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9 VALUE 1.
 01 Y PIC 9(3).
 PROCEDURE DIVISION.
 MAIN.
     IF X = 1
         COMPUTE Y = 2 + 3 * 4
         DISPLAY Y
         PERFORM CHEER 2 TIMES
     END-IF.
     STOP RUN.

 CHEER.
     DISPLAY "WOO".
