 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9 VALUE 7.
 PROCEDURE DIVISION.
     IF X = 0
         DISPLAY "ZERO"
         DISPLAY "STILL-ZERO"
     ELSE
         DISPLAY "NON-ZERO"
         DISPLAY "MOVING-ON"
     END-IF.
     STOP RUN.
