 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9 VALUE 0.
 PROCEDURE DIVISION.
     IF X = 0
         DISPLAY "FIRST".
         DISPLAY "SECOND"
         DISPLAY "THIRD".
         DISPLAY "FOURTH"
     END-IF.
     STOP RUN.
