 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9 VALUE 0.
 01 Y PIC 9(2) VALUE 5.
 PROCEDURE DIVISION.
     IF X = 0
         DISPLAY "ZERO"
         MOVE 1 TO X
         ADD 10 TO Y
         DISPLAY Y
     END-IF.
     DISPLAY "DONE".
     STOP RUN.
