 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 I PIC S9(2).
 PROCEDURE DIVISION.
 MAIN.
     PERFORM TICK VARYING I FROM 3 BY -1 UNTIL I < 1.
     STOP RUN.
 TICK.
     DISPLAY I.
