 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 BALANCE PIC S9(5) VALUE -100.
 PROCEDURE DIVISION.
     DISPLAY BALANCE.
