 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 RECORD.
    02 LABEL PIC X(5) VALUE "ITEM:".
    02 COUNT PIC 9(3) VALUE 42.
    02 SEP   PIC X(2) VALUE " /".
    02 PRICE PIC 9(4) VALUE 1995.
 PROCEDURE DIVISION.
     DISPLAY RECORD.
     STOP RUN.
