 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 RESULT PIC 9(4).
 PROCEDURE DIVISION.
     COMPUTE RESULT = 2 + 3 * 4.
     DISPLAY RESULT.
