 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 RESULT PIC 9(3).
 PROCEDURE DIVISION.
     COMPUTE RESULT = MISSING + 1.
