 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(2) VALUE 5.
 01 Y PIC 9(2) VALUE 7.
 01 RESULT PIC 9(4).
 PROCEDURE DIVISION.
     COMPUTE RESULT = X * Y + X.
     DISPLAY RESULT.
