 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM OUTER.
     STOP RUN.
 OUTER.
     DISPLAY "OUTER-PRE".
     PERFORM INNER.
     DISPLAY "OUTER-POST".
 INNER.
     DISPLAY "INNER".
