 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM HALT.
     DISPLAY "AFTER MAIN".
     STOP RUN.
 HALT.
     DISPLAY "BEFORE STOP".
     STOP RUN.
     DISPLAY "AFTER STOP".
