 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM SUB 0 TIMES.
     DISPLAY "AFTER".
     STOP RUN.
 SUB.
     DISPLAY "RAN".
