 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 N PIC 9(2) VALUE 5.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM TICK UNTIL N >= 3.
     DISPLAY "AFTER".
     STOP RUN.
 TICK.
     DISPLAY "RAN".
