 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 N PIC 9(2) VALUE 0.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM TICK UNTIL N >= 3.
     STOP RUN.
 TICK.
     DISPLAY N.
     ADD 1 TO N.
