 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 I PIC 9(2).
 PROCEDURE DIVISION.
 MAIN.
     PERFORM SHOW VARYING I FROM 1 BY 1 UNTIL I > 4.
     STOP RUN.
 SHOW.
     DISPLAY I.
