 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 I PIC 9(2).
 PROCEDURE DIVISION.
 MAIN.
     PERFORM SHOW VARYING I FROM 2 BY 3 UNTIL I > 10.
     STOP RUN.
 SHOW.
     DISPLAY I.
