 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 I PIC 9(2).
 01 START PIC 9(2) VALUE 4.
 01 STEP PIC 9(2) VALUE 2.
 01 LIMIT PIC 9(2) VALUE 10.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM SHOW VARYING I FROM START BY STEP UNTIL I > LIMIT.
     STOP RUN.
 SHOW.
     DISPLAY I.
