 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(2) VALUE 5.
 PROCEDURE DIVISION.
 MAIN.
     DISPLAY "M-1".
     PERFORM SUB.
     DISPLAY "M-2".
     STOP RUN.
 SUB.
     DISPLAY "S-1".
     IF X > 0
         EXIT PARAGRAPH.
     END-IF.
     DISPLAY "S-2".
