 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     DISPLAY "M-1".
     EXIT PARAGRAPH.
     DISPLAY "M-2".
 NEXT-PARA.
     DISPLAY "NEXT".
     STOP RUN.
