 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 I PIC 9(2).
 PROCEDURE DIVISION.
 MAIN.
     PERFORM STEP VARYING I FROM 1 BY 1 UNTIL I > 10.
     DISPLAY "AFTER".
     STOP RUN.
 STEP.
     DISPLAY I.
     IF I = 4
         EXIT PERFORM.
     END-IF.
