 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     DISPLAY "MAIN-1".
     PERFORM SUB.
     DISPLAY "MAIN-2".
     STOP RUN.
 SUB.
     DISPLAY "SUB-1".
     EXIT PARAGRAPH.
     DISPLAY "SUB-2".
