 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 I PIC 9(2) VALUE 0.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM STEP UNTIL I > 99.
     DISPLAY "AFTER".
     STOP RUN.
 STEP.
     ADD 1 TO I.
     DISPLAY I.
     IF I = 3
         EXIT PERFORM.
     END-IF.
