 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     DISPLAY "MAIN".
     PERFORM PLACEHOLDER.
     DISPLAY "AFTER-PERFORM".
     STOP RUN.
 PLACEHOLDER.
     EXIT.
