 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 SRC PIC 9(3) VALUE 12.
 01 DEST PIC 9(3).
 PROCEDURE DIVISION.
     MOVE SRC TO DEST.
     DISPLAY DEST.
