 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(2).
 01 B PIC 9(2).
 01 C PIC 9(2).
 PROCEDURE DIVISION.
     MOVE 7 TO A B C.
     DISPLAY A B C.
