 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3).
 PROCEDURE DIVISION.
     MOVE 42 TO X.
     DISPLAY X.
