 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 RECORD.
    05 FIELD PIC X(5).
 PROCEDURE DIVISION.
     MOVE "X" TO RECORD.
