 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME PIC X(5).
 PROCEDURE DIVISION.
     MOVE "MATT" TO NAME.
     DISPLAY NAME.
