 IDENTIFICATION DIVISION.
 PROGRAM-ID. COMPUTE-DEMO.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(2) VALUE 4.
 01 Y PIC 9(4)V99.

 PROCEDURE DIVISION.
     DISPLAY "X = " X.
     COMPUTE Y = X ** 2 + 2 * X + 1.
     DISPLAY "X^2 + 2X + 1 = " Y.
     COMPUTE Y = (X + 1) * (X + 2).
     DISPLAY "(X + 1)(X + 2) = " Y.
     STOP RUN.
