 IDENTIFICATION DIVISION.
 PROGRAM-ID. HELLO-NAME.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 USER-NAME PIC X(20).

 PROCEDURE DIVISION.
     DISPLAY "WHAT IS YOUR NAME? " WITH NO ADVANCING.
     ACCEPT USER-NAME.
     DISPLAY "HELLO, " USER-NAME.
     STOP RUN.
