 IDENTIFICATION DIVISION.
 PROGRAM-ID. IF-DEMO.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 N PIC S9(3).

 PROCEDURE DIVISION.
     DISPLAY "ENTER A NUMBER (1-100): " WITH NO ADVANCING.
     ACCEPT N.

     IF N = 0 THEN
         DISPLAY "ZERO".
     END-IF.

     IF N > 50 THEN
         DISPLAY "BIGGER THAN 50".
     ELSE
         DISPLAY "50 OR LESS".
     END-IF.

     IF N >= 1 AND N <= 100 THEN
         DISPLAY "IN RANGE".
     ELSE
         DISPLAY "OUT OF RANGE".
     END-IF.

     STOP RUN.
