 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME PIC X(10) VALUE "matt".
 PROCEDURE DIVISION.
     DISPLAY "HELLO " FUNCTION UPPER-CASE(FUNCTION TRIM(NAME)) "!".
     STOP RUN.
