 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 NAME       PIC X(10) VALUE "matt".
 01 NAME-UPPER PIC X(10).
 PROCEDURE DIVISION.
     MOVE FUNCTION UPPER-CASE(NAME) TO NAME-UPPER.
     DISPLAY NAME-UPPER.
     STOP RUN.
