 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3).
 PROCEDURE DIVISION.
     MOVE FUNCTION INTEGER(7.9) TO X.
     DISPLAY X.
     STOP RUN.
