 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 N PIC 9(3).
 PROCEDURE DIVISION.
     MOVE FUNCTION UPPER-CASE("abc") TO N.
     STOP RUN.
