 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 PROCEDURE DIVISION.
 MAIN.
     PERFORM CHEER FUNCTION INTEGER(3.7) TIMES.
     STOP RUN.

 CHEER.
     DISPLAY "WOO".
