 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(3) VALUE 12.
 01 B PIC 9(3) VALUE 30.
 PROCEDURE DIVISION.
     DIVIDE 2 INTO A B.
     DISPLAY A " " B.
