 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 20.
 PROCEDURE DIVISION.
     DIVIDE 5 INTO X.
     DISPLAY X.
