 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(2) VALUE 6.
 01 B PIC 9(2) VALUE 7.
 01 C PIC 9(3).
 PROCEDURE DIVISION.
     MULTIPLY A BY B GIVING C.
     DISPLAY C.
