 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 X PIC 9(3) VALUE 4.
 PROCEDURE DIVISION.
     MULTIPLY 5 BY X.
     DISPLAY X.
