 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 A PIC 9(3) VALUE 3.
 01 B PIC 9(3) VALUE 4.
 PROCEDURE DIVISION.
     MULTIPLY 2 BY A B.
     DISPLAY A " " B.
