 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 LABEL PIC X(10).
 PROCEDURE DIVISION.
     ACCEPT LABEL.
     DISPLAY LABEL.
