 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 USER-NAME PIC X(10).
 PROCEDURE DIVISION.
     ACCEPT USER-NAME.
     DISPLAY USER-NAME.
