 IDENTIFICATION DIVISION.
 PROGRAM-ID. P.
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 01 N PIC S9(3).
 PROCEDURE DIVISION.
     ACCEPT N.
     DISPLAY N.
